Christine Martinez Module 4 Project- Task 2

Task 1- Create Data Frame

In [2]:
import pandas as pd

In [3]:
grades_dict= {'Wally' :[87,96,70], 'Eva':[100,87,90], 'Sam':[94,77,90], 'Katie':[100,81,82],'Bob':[83,65,85]}
grades=pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

Task 2- Custom Index

In [10]:
grades.index=['Test1', 'Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [4]:
grades['Eva']

0    100
1     87
2     90
Name: Eva, dtype: int64

In [5]:
grades.Sam

0    94
1    77
2    90
Name: Sam, dtype: int64

In [6]:
grades.Wally

0    87
1    96
2    70
Name: Wally, dtype: int64

In [7]:
grades.Katie

0    100
1     81
2     82
Name: Katie, dtype: int64

Task 3 Accessing Rows and Accessing Subsets

Accessing Rows

In [11]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [13]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [15]:
grades.iloc[0:3]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

Question: Which do you prefer? I think I prefer iloc

In [16]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

In [18]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [20]:
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

Subsets

In [25]:
grades.loc['Test1':'Test2',['Eva','Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [30]:
grades.iloc[[0,1],[1,3]]

       Eva  Katie
Test1  100    100
Test2   87     81

I was able to retrieve Katie's and Eva's test scores from test 1 and 2

Task 4- Describe, by Column